---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ZeroLengthViewBreaksRemoved
source: html/c5f8ca54-2af2-f722-26ce-105e3e5d0b1c.htm
---
# Autodesk.Revit.DB.BuiltInFailures.ViewFailures.ZeroLengthViewBreaksRemoved Property

Some View Regions were consolidated. When the size of a View Break between View Regions becomes zero, the View Break
 is removed and the adjacent View Regions are joined.

## Syntax (C#)
```csharp
public static FailureDefinitionId ZeroLengthViewBreaksRemoved { get; }
```